In [1]:
# Dependencies
import pandas as pd

In [2]:
# load file from Hank's PC
heroes_df = r"C:\Users\Hank\Richmond Bootcamp\Resources\purchase_data.csv"
heroes_df = pd.read_csv(heroes_df)

In [3]:
# verify file load by printing out .head() view
heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
# get column header names
heroes_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

## Player Count

In [5]:
# get player count using .unique() method as there are duplicate player names from multiple purchases
player_count = len(heroes_df['SN'].unique())

In [6]:
# print out table with player count
summary_table = pd.DataFrame({"Total Players":[player_count]})
summary_table

   Total Players
0            576

## Purchasing Analysis (Total)

In [7]:
# populate additional variables for summary table
avg_price = heroes_df["Price"].mean()
avg_age = heroes_df["Age"].mean()
nmbr_unique = len(heroes_df["Item ID"].unique())
nmbr_purch = len(heroes_df["Purchase ID"].value_counts())
sum_purch = heroes_df["Price"].sum()

In [8]:
# print summary table with requested (and additioanl) variables
summary_df = pd.DataFrame({"# of Unique Items":[nmbr_unique],"Avg. Price":[avg_price],
                           "# Purchased":[nmbr_purch],"Total Revenue":[sum_purch],
                           "Total Players":[player_count],"Avg. Age":[avg_age]})
summary_df

,# of Unique Items,Avg. Price,# Purchased,Total Revenue,Total Players,Avg. Age
0,183,3.050987,780,2379.77,576,22.714103

In [9]:
# use .map method to adjust variable formats and print updated table
summary_df["Avg. Price"] = summary_df["Avg. Price"].map("${:.2f}".format)
summary_df["Avg. Age"] = summary_df["Avg. Age"].map("{:.1f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map("${:,.2f}".format)
summary_df

,# of Unique Items,Avg. Price,# Purchased,Total Revenue,Total Players,Avg. Age
0,183,$3.05,780,"$2,379.77",576,22.7

## Gender Demographics

In [10]:
# get new table for gender counts without duplicate player names from multiple purchases
# Statement to dop duplicates in 'SN' field, so we can calculate Gender series totals without dupes
no_dupes_heroes_df = heroes_df.drop_duplicates("SN")
no_dupes_heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [11]:
player_count = len(heroes_df['SN'].unique())
player_count

576

In [12]:
gender_count = no_dupes_heroes_df["Gender"].value_counts()
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [13]:
gender_percent = (gender_count/player_count)
gender_percent

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [14]:
gender_demographics_df = pd.DataFrame({"Total Count":gender_count,"Percentage of Players":gender_percent})

In [15]:
gender_demographics_df["Percentage of Players"] = gender_demographics_df["Percentage of Players"].map("{:.2%}".format)
gender_demographics_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

## Purchasing Analysis (Gender)

In [16]:
# create df based on "Gender" series and calculate variables to populate df
heroes_df_grouped = heroes_df.groupby("Gender")

In [17]:
nmbr_purch_gender = heroes_df_grouped["Gender"].count()
nmbr_purch_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [18]:
avg_gender_price = heroes_df_grouped["Price"].mean()
avg_gender_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [19]:
total_gender_purch = heroes_df_grouped["Price"].sum()
total_gender_purch

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [20]:
avg_gender_purch = total_gender_purch/gender_count
avg_gender_purch

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [21]:
purch_analysis_gender = pd.DataFrame({"Purchase Count":nmbr_purch_gender,"Avg. Purchase Price":avg_gender_price,
                                     "Total Purchase Value":total_gender_purch,
                                      "Avg. Total Purchase per Person":avg_gender_purch})

In [22]:
purch_analysis_gender["Avg. Purchase Price"] = purch_analysis_gender["Avg. Purchase Price"].map("${:.2f}".format)
purch_analysis_gender["Total Purchase Value"] = purch_analysis_gender["Total Purchase Value"].map("${:,.2f}".format)
purch_analysis_gender["Avg. Total Purchase per Person"] = purch_analysis_gender["Avg. Total Purchase per Person"].map("${:.2f}".format)
purch_analysis_gender

,Purchase Count,Avg. Purchase Price,Total Purchase Value,Avg. Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

In [23]:
heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [24]:
# Age Demographics
# Create bins in which data will be loaded
bins = [0,9,14,19,24,29,34,39,100]
# Create group names for the 8 bin age categories
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [25]:
# Establish the new column for the no_dupes_heroes_df
no_dupes_heroes_df["Age Category"] = pd.cut(no_dupes_heroes_df["Age"], bins, labels = group_names)

C:\Users\Hank\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [35]:
# Display the new table
no_dupes_heroes_df = no_dupes_heroes_df.groupby("Age Category")
no_dupes_heroes_df.max()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
Age Category,,,,,,,
<10,778,Tyeurith29,9,Male,179,"Wolf, Promise of the Moonwalker",4.93
10-14,774,Zhisrisu83,14,Male,180,Wolf,4.94
15-19,771,Yoishirrala98,19,Other / Non-Disclosed,183,Yearning Mageblade,4.91
20-24,777,Zontibe81,24,Other / Non-Disclosed,183,Yearning Mageblade,4.99
25-29,724,Yasur35,29,Other / Non-Disclosed,181,Worldbreaker,4.94
30-34,730,Yarolwen77,34,Male,178,Woeful Adamantite Claymore,4.93
35-39,753,Tyaerith73,39,Other / Non-Disclosed,179,"Wolf, Promise of the Moonwalker",4.91
40+,761,Salilis27,45,Male,173,Victor Iron Spikes,4.93

In [36]:
# Calculate variables based on the no_dupes_heroes_df
# Total players in each age category
cat_player_count = no_dupes_heroes_df["SN"].count()
cat_player_count

Age Category
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [37]:
# The percent of players in each age category
cat_player_percent = cat_player_count/player_count
cat_player_percent

Age Category
<10      0.029514
10-14    0.038194
15-19    0.185764
20-24    0.447917
25-29    0.133681
30-34    0.090278
35-39    0.053819
40+      0.020833
Name: SN, dtype: float64

In [38]:
# Create new df to display the results, using the created variables
bins_percent_table = pd.DataFrame({"Total Count":cat_player_count,"Percentage of Players":cat_player_percent})
bins_percent_table["Percentage of Players"] = bins_percent_table["Percentage of Players"].map("{:.2%}".format)
bins_percent_table

              Total Count Percentage of Players
Age Category
<10                    17                 2.95%
10-14                  22                 3.82%
15-19                 107                18.58%
20-24                 258                44.79%
25-29                  77                13.37%
30-34                  52                 9.03%
35-39                  31                 5.38%
40+                    12                 2.08%

## Purchasing Analysis (Age)

In [40]:
# Re-orient thinking from the no_dupes_df back to original df
heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [41]:
# Set new df name to do next .cut statement and preserve original heroes_df
heroes_df_age = heroes_df
heroes_df_age.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [42]:
# Set up "Age Category" with .cut statement
heroes_df_age["Age Category"] = pd.cut(heroes_df["Age"], bins, labels = group_names)
heroes_df_age.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [43]:
# Establish bins based on the heroes_df_age df
heroes_df_bins = heroes_df_age.groupby("Age Category")
heroes_df_bins.max()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
Age Category,,,,,,,
<10,778,Tyeurith29,9,Male,179,"Wolf, Promise of the Moonwalker",4.93
10-14,774,Zhisrisu83,14,Male,180,Wolf,4.94
15-19,771,Yoishirrala98,19,Other / Non-Disclosed,183,Yearning Mageblade,4.91
20-24,779,Zontibe81,24,Other / Non-Disclosed,183,Yearning Mageblade,4.99
25-29,772,Yasur35,29,Other / Non-Disclosed,183,Worldbreaker,4.94
30-34,770,Yarolwen77,34,Male,178,Yearning Mageblade,4.93
35-39,768,Tyaerith73,39,Other / Non-Disclosed,179,"Wolf, Promise of the Moonwalker",4.91
40+,761,Salilis27,45,Male,173,Victor Iron Spikes,4.93

In [44]:
# Create variables based on the new heroes_df_bins
# Determine the total number of items in each category
cat_id_count = heroes_df_bins["Purchase ID"].count()
cat_id_count

Age Category
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [45]:
# Determine the sum of purchases in each aage category
cat_purch_sum = heroes_df_bins["Price"].sum()
cat_purch_sum

Age Category
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [46]:
# Determine the average price based on the category sum and the number of items in the category
cat_avg_price = cat_purch_sum/cat_id_count
cat_avg_price

Age Category
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
dtype: float64

In [47]:
# Display how many names are in each age category (includes duplicates)
cat_nmbr_people = heroes_df_bins["SN"].count()
cat_nmbr_people

Age Category
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [48]:
# Display the mutually exclusive number of names in each category (without dupes from earlier data)
cat_player_count

Age Category
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [49]:
# Calculate the average purchases per player
avg_tot_purch_pers = cat_purch_sum/cat_player_count
avg_tot_purch_pers

Age Category
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [50]:
# Create new df to display the variable results
purch_anal_sum_table = pd.DataFrame({"Purchase Count":cat_nmbr_people,"Avg. Purch. Price":cat_avg_price,
                                    "Total Purch. Value":cat_purch_sum,
                                     "Avg. Total Purch. per Person":avg_tot_purch_pers})

purch_anal_sum_table["Avg. Purch. Price"]= purch_anal_sum_table["Avg. Purch. Price"].map("${:.2f}".format)
purch_anal_sum_table["Total Purch. Value"]= purch_anal_sum_table["Total Purch. Value"].map("${:.2f}".format)
purch_anal_sum_table["Avg. Total Purch. per Person"]= purch_anal_sum_table["Avg. Total Purch. per Person"].map("${:.2f}".format)

purch_anal_sum_table

,Purchase Count,Avg. Purch. Price,Total Purch. Value,Avg. Total Purch. per Person
Age Category,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

In [51]:
# re-focus thinking, back to the original df
heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [52]:
# Determine the number of purchases per player
sn_count = heroes_df["SN"].value_counts()
sn_count.head()

Lisosia93       5
Idastidru52     4
Iral74          4
Phyali88        3
Chanastnya43    3
Name: SN, dtype: int64

In [54]:
# create grouped df based on Screen Name ("SN") series and calculate variables
heroes_df_grouped = heroes_df.groupby("SN")

In [55]:
# Determine avg. price per player
avg_price = heroes_df_grouped["Price"].mean()
avg_price.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [56]:
# Determine the total purchases per player
sum_price = heroes_df_grouped["Price"].sum()
sum_price.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [57]:
# Count the number of items in each "SN" category
item_name_count = heroes_df_grouped["Item Name"].count()
item_name_count.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Item Name, dtype: int64

In [58]:
# Create new df to display results based on the variables
top_spenders_table = pd.DataFrame({"Purchase Count":item_name_count,"Avg. Purchase Price":avg_price,
                                     "Total Purchase Value":sum_price})
top_spenders_table=top_spenders_table.sort_values("Purchase Count",ascending=False)
top_spenders_table.head()

             Purchase Count  Avg. Purchase Price  Total Purchase Value
SN
Lisosia93                 5             3.792000                 18.96
Iral74                    4             3.405000                 13.62
Idastidru52               4             3.862500                 15.45
Asur53                    3             2.480000                  7.44
Inguron55                 3             3.703333                 11.11

In [59]:
# Apply formatting changes AFTER new table created - protocol for future sorting
top_spenders_table["Avg. Purchase Price"]=top_spenders_table["Avg. Purchase Price"].map("${:.2f}".format)
top_spenders_table["Total Purchase Value"]=top_spenders_table["Total Purchase Value"].map("${:.2f}".format)
top_spenders_table.head()

             Purchase Count Avg. Purchase Price Total Purchase Value
SN
Lisosia93                 5               $3.79               $18.96
Iral74                    4               $3.40               $13.62
Idastidru52               4               $3.86               $15.45
Asur53                    3               $2.48                $7.44
Inguron55                 3               $3.70               $11.11

## Most Popular Items

In [60]:
# Validate integrity of original df_heroes
heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [63]:
# create df based on Screen Name/"SN" series
heroes_df_grouped_item = heroes_df.groupby(["Item ID","Item Name"])

In [64]:
# Calculate variables to populate forthcoming most popular items df
# Calculate the number of purchases per item
item_id_name_count = heroes_df_grouped_item["Item Name"].count()
item_id_name_count.head()

Item ID  Item Name
0        Splinter              4
1        Crucifer              3
2        Verdict               6
3        Phantomlight          6
4        Bloodlord's Fetish    5
Name: Item Name, dtype: int64

In [65]:
# Determine total purchases per item name
item_id_price_sum = heroes_df_grouped_item["Price"].sum()
item_id_price_sum.head()

Item ID  Item Name
0        Splinter               5.12
1        Crucifer               9.78
2        Verdict               14.88
3        Phantomlight          14.94
4        Bloodlord's Fetish     8.50
Name: Price, dtype: float64

In [66]:
# Calculate price per item
item_id_price = item_id_price_sum/item_id_name_count
item_id_price.head()

Item ID  Item Name
0        Splinter              1.28
1        Crucifer              3.26
2        Verdict               2.48
3        Phantomlight          2.49
4        Bloodlord's Fetish    1.70
dtype: float64

In [74]:
# Build most popular item df based on created variables and sort, descending, based on purch by item
most_popular_items_df = pd.DataFrame({"Purchase Count":item_id_name_count,"Item Price":item_id_price,
                                   "Total Purchase Value":item_id_price_sum})
most_popular_items_df_sorted = most_popular_items_df.sort_values("Purchase Count",ascending=False)
most_popular_items_df_sorted.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [75]:
# Appply formatting to most popular item table
most_popular_items_df_sorted["Item Price"] = most_popular_items_df_sorted["Item Price"].map("${:.2f}".format)
most_popular_items_df_sorted["Total Purchase Value"] = most_popular_items_df_sorted["Total Purchase Value"].map("${:.2f}".format)
most_popular_items_df_sorted.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

In [77]:
# Build new df sorted by the highest revenue per item
most_profitable_item_df = pd.DataFrame({"Purchase Count":item_id_name_count,"Item Price":item_id_price,
                                   "Total Purchase Value":item_id_price_sum})
most_profitable_item_sorted = most_profitable_item_df.sort_values("Total Purchase Value",ascending=False)
most_profitable_item_sorted.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

In [78]:
# Apply formatting to table
most_profitable_item_sorted["Item Price"] = most_profitable_item_sorted["Item Price"].map("${:.2f}".format)
most_profitable_item_sorted["Total Purchase Value"] = most_profitable_item_sorted["Total Purchase Value"].map("${:.2f}".format)
most_profitable_item_sorted.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80